hugo.org
#+TITLE: Hugo
#+HUGO_BASE_DIR: ./
#+HUGO_SECTION: ./posts/

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+options: author:nil

** SD to Austin - 18 months later
:PROPERTIES:
:EXPORT_DATE: 2020-04-12
:EXPORT_FILE_NAME: austin-18-months-later
:END:
It's been a little over 18 months since we moved to Austin and this post about 6
months overdue. I apologize as It's been quite busy since starting a new job
shortly before the one year anniversary, but with the world on lockdown, I find
myself with a little more time to devote to hobbies, back-logged projects, and
self-improvement. Without rambling too much longer, I'd like to go over my
thoughts on living in Austin over the past 18 months.

*** The People
As I noted in the original post on moving to Austin from SD. People being very
friendly has held true. I've continually noticed that people will go out of
their way to help you. Something I didn't see quite as much in CA. Not to say
people in CA are not friendly. I just felt it was less likely to have a random
stranger offer help.

I do feel for the Austinites that have lived here for decades as the city is a
shell of what it was before. The sheer growth of people from all over the
country has changed the cities characted. For better of for worse is up for
debate. Also, more and more people are being affected from the increased CoL and
its apparent with the growing homeless population. It is more troublesome than
what I have experienced in San Diego and hope solutions are put in place to help
those affected.

*** The Cost of Living
Yes, I raved about the cost of living before and it is still a lot cheaper but
not as much as I would have expected. There are still expensive areas and
restaurants in Austin and it's only getting more expensive. Housing prices are
not much less than SD in desirable areas near the city center but significantly
more so in the suburbs. I've benefited from not paying property taxes thus far and
am not looking forward to doing so in the coming months when I move forward with
purchasing property here. Most of the savings come in everyday expenses such as gas
and groceries. There is also the added benefit of renting and not having state
income tax. The extra cash pocketed has funded increased travel and savings
which I'd take in a heartbeat over the so-called beach/weather tax in CA.

*** Job Market
Being a software engineer, I don't think theres a better place to be. Sure there
are other hot spots in SF, NY, Seattle, etc. but they are all very expensive CoL
wise and I suspect don't have the growing city vibe that I have grown to love in
Austin. I have first hand experienced the job market when I lost my job last
year and was able to land a gig with a company that I am very happy to be a part
of. I don't think I would have been exposed to as great opportunities had I
stayed in San Diego. On top of it all I love that kolaches and breakfast tacos
are regularly brought in for lunch.

*** Food
Outstanding. I haven't found a shortage of any cuisine I am interested in. Sure
there is better quality and diversity in food capitals such as NY, LA, or SF but
there hasn't been an issue as nearly everything is here that would satisfy my
cravings. With frequent trips out to SoCal to visit family there is nothing
missed. Not to mention foods in Texas that can't be found elsewhere -- BBQ, TX
style Tacos, kolaches, and a wide range of fusion foods.

*** Traffic
It's not nearly as bad as other major cities from what I've experienced, but
very bad for the city size. The infrastructure is just not their to support the
booming population. I do not look forward to the day I have to commute.

*** TLDR
Austin is a great city. It is struggling growing pains like increased
traffic, homelessness, and an increasing CoL but the good has outweighed the bad
and I look forward to planting some roots here and purchasing a home in the near
future.

